** Putting it all together 

#+BEGIN_SRC clojure
(def asym-hobbit-body-parts [{:name "head" :size 3}
                             {:name "left-eye" :size 1}
                             {:name "left-ear" :size 1}
                             {:name "mouth" :size 1}
                             {:name "nose" :size 1}
                             {:name "neck" :size 2}
                             {:name "left-shoulder" :size 3}
                             {:name "left-upper-arm" :size 3}
                             {:name "chest" :size 10}
                             {:name "back" :size 10}
                             {:name "left-forearm" :size 3}
                             {:name "abdomen" :size 6}
                             {:name "left-kidney" :size 1}
                             {:name "left-hand" :size 2}
                             {:name "left-knee" :size 2}
                             {:name "left-thigh" :size 4}
                             {:name "left-lower-leg" :size 3}
                             {:name "left-achilles" :size 1}
                             {:name "left-foot" :size 2}])
#+END_SRC

This is a vector of maps, in which each map has the name of the body part and relative size of the body part. 

We are missing the right side of the hobbit

#+BEGIN_SRC clojure
(defn matching-part
  [part]
  {:name (clojure.string/replace (:name part) #"^left-" "right-")
   :size (:size part)})

(defn symmetrize-body-parts
  "Expects a sequence of maps that have a :name and :size"
  [asym-body-parts]
  (loop [remaining-asym-parts asym-body-parts
         final-body-parts []]
    (if (empty? remaining-asym-parts)
      final-body-parts
      (let [[part & remaining] remaining-asym-parts]
        (recur remaining
               (into final-body-parts
                     (set [part (matching-part part)])))))))
#+END_SRC

When we call symmetrize-body-parts on asym-hobbit-body-parts we get a fully symmetrical hobbit 

#+BEGIN_SRC clojure
(symmetrize-body-parts asym-hobbit-body-parts)
#+END_SRC

#+RESULTS:
| :name | head            | :size |  3 |
| :name | left-eye        | :size |  1 |
| :name | right-eye       | :size |  1 |
| :name | left-ear        | :size |  1 |
| :name | right-ear       | :size |  1 |
| :name | mouth           | :size |  1 |
| :name | nose            | :size |  1 |
| :name | neck            | :size |  2 |
| :name | left-shoulder   | :size |  3 |
| :name | right-shoulder  | :size |  3 |
| :name | right-upper-arm | :size |  3 |
| :name | left-upper-arm  | :size |  3 |
| :name | chest           | :size | 10 |
| :name | back            | :size | 10 |
| :name | left-forearm    | :size |  3 |
| :name | right-forearm   | :size |  3 |
| :name | abdomen         | :size |  6 |
| :name | left-kidney     | :size |  1 |
| :name | right-kidney    | :size |  1 |
| :name | left-hand       | :size |  2 |
| :name | right-hand      | :size |  2 |
| :name | right-knee      | :size |  2 |
| :name | left-knee       | :size |  2 |
| :name | right-thigh     | :size |  4 |
| :name | left-thigh      | :size |  4 |
| :name | right-lower-leg | :size |  3 |
| :name | left-lower-leg  | :size |  3 |
| :name | right-achilles  | :size |  1 |
| :name | left-achilles   | :size |  1 |
| :name | right-foot      | :size |  2 |
| :name | left-foot       | :size |  2 |

let binds values to names 

#+BEGIN_SRC clojure
(let [x 3] x)

(def dalmation-list ["Pongo" "Perdita" "Puppy 1" "Puppy 2"])

(let [dalmations (take 2 dalmation-list)]
  dalmations)

(def x 0)
(let [x 1] x)
(let [x (inc x)] x)

(let [[pongo & dalmations] dalmation-list]
  [pongo dalmations])
#+END_SRC

#+BEGIN_SRC clojure
; create a new scope with part as first element and remaining as rest 
(let [[part & remaining] remaining-asym-parts]
  ; for the remaining elements
  (recur remaining
         ; place the results into a scope called final-body-parts
         (into final-body-parts
               ; return a set with the first element and its matching body part 
               (set [part (matching-part part)]))))
#+END_SRC

loop provides another way to do recursion in clojure 

#+BEGIN_SRC clojure
(loop [iteration 0]
  (println (str "Iteration " iteration))
  (if (> iteration 3)
    (println "Goodbye!")
    (recur (inc iteration))))

; alternatively 
(defn recursive-printer
  ([]
   (recursive-printer 0))
  ([iteration]
   (println iteration)
   (if (> iteration 3)
     (println "Goodbye!")
     (recursive-printer (inc iteration)))))

(recursive-printer)
#+END_SRC

